month = int(input("Введите номер месяца "))
month_list = ['Зима', 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето', 'Лето', 'Осень', 'Осень', 'Осень', 'Зима']

for ind, el in enumerate(month_list):
    if month is ind+1:
        print(el)
        break

month_dict = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Осень", 6: "Лето", 7: "Лето", 8: "Лето",
              9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}
if 0 < month < 13:
    print(month_dict.get(month))
else:
    print("Значие должно быть больше 0 и меньше 13")
